app/controllers/session_controller.rb

  def create
    email = params["email"]
    password = params["password"]

    begin
      user = User.find_by!(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "pearlsbeardoil@gmail.com"], ["LIMIT", 1]]